[Killed] BlockStatement
src/routes/hello.ts:3:38
 import { IncomingMessage, ServerResponse } from 'http';
 
-export function createHelloHandler() {
-  return (_req: IncomingMessage, res: ServerResponse): void => {
-    res.writeHead(200, { 'Content-Type': 'application/json' });
-    res.end(JSON.stringify({ message: 'Hello, World!' }));
-  };
-}
+export function createHelloHandler() {}
 
killedBy: Hello Endpoint should return JSON with message "Hello, World!"
statusReason: handler is not a function

[Killed] BlockStatement
src/routes/hello.ts:4:64
 import { IncomingMessage, ServerResponse } from 'http';
 
 export function createHelloHandler() {
-  return (_req: IncomingMessage, res: ServerResponse): void => {
-    res.writeHead(200, { 'Content-Type': 'application/json' });
-    res.end(JSON.stringify({ message: 'Hello, World!' }));
-  };
+  return (_req: IncomingMessage, res: ServerResponse): void => {};
 }
 
killedBy: Hello Endpoint should return JSON with message "Hello, World!"
statusReason: expected +0 to be 200 // Object.is equality

[Killed] StringLiteral
src/routes/hello.ts:5:42
 
 export function createHelloHandler() {
   return (_req: IncomingMessage, res: ServerResponse): void => {
-    res.writeHead(200, { 'Content-Type': 'application/json' });
+    res.writeHead(200, { 'Content-Type': "" });
     res.end(JSON.stringify({ message: 'Hello, World!' }));
   };
killedBy: Hello Endpoint should return JSON with message "Hello, World!"
statusReason: expected '' to be 'application/json' // Object.is equality

[Killed] ObjectLiteral
src/routes/hello.ts:5:24
 
 export function createHelloHandler() {
   return (_req: IncomingMessage, res: ServerResponse): void => {
-    res.writeHead(200, { 'Content-Type': 'application/json' });
+    res.writeHead(200, {});
     res.end(JSON.stringify({ message: 'Hello, World!' }));
   };
killedBy: Hello Endpoint should return JSON with message "Hello, World!"
statusReason: expected undefined to be 'application/json' // Object.is equality

[Killed] StringLiteral
src/routes/hello.ts:6:39
 export function createHelloHandler() {
   return (_req: IncomingMessage, res: ServerResponse): void => {
     res.writeHead(200, { 'Content-Type': 'application/json' });
-    res.end(JSON.stringify({ message: 'Hello, World!' }));
+    res.end(JSON.stringify({ message: "" }));
   };
 }
killedBy: Hello Endpoint should return JSON with message "Hello, World!"
statusReason: expected { message: '' } to deeply equal { message: 'Hello, World!' }

[Killed] ObjectLiteral
src/routes/hello.ts:6:28
 export function createHelloHandler() {
   return (_req: IncomingMessage, res: ServerResponse): void => {
     res.writeHead(200, { 'Content-Type': 'application/json' });
-    res.end(JSON.stringify({ message: 'Hello, World!' }));
+    res.end(JSON.stringify({}));
   };
 }
killedBy: Hello Endpoint should return JSON with message "Hello, World!"
statusReason: expected {} to deeply equal { message: 'Hello, World!' }
